VstrmIntg/CacheManagement/CMEV2/gSoapFiles/CMEServiceSoapBinding.cacheNotification.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://www.schange.com/services/CMEService">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:cacheNotification>
   <providerID></providerID>
   <providerAssetID></providerAssetID>
   <clusterID></clusterID>
   <status>0</status>
  </ns1:cacheNotification>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
